import sample_img from "./imgs/sample-blog-img.webp";
const post_cats = {
    cat_1 : "مقاله",
    cat_2 : "خبر",
    cat_3 : "",
    cat_4 : "",
    cat_5 : "",
    cat_6 : "",
    cat_7 : "",
}
const sample_post = {
    id : 1,
    keywords : "",
    description : "",
    similar_post : [],
    post_cat : post_cats.cat_1,
    final_word : {
    title : "",
    text : "",
    cta : {
        link : "",
        text : "",
    }
    },
    sections : [
        {
            
            id : 1 , 
            title : "",
            text : ``,
            img : false,
            cta : {
                link : "",
                text : "",
            },
            
        }
    ]
}
const posts = [
    {
        id : 1, 
        keywords : "درس خواندن برای کنکور, درس خواندن, راهکار هایی برای درس بهتر خواندن, چگونه بهتر درس بخوانیم , درس خواندن بهینه",
        description : "برای تمامی دانش آموزان به خصوص دانش آموزان کنکوری همواره این سوال وجود دارد که چه راهی برای بهتر درس خواندن وجود دارد ؟راه های بهتر درس خواندن چیست ؟نگران نباشید تیم کاد با کمک مشاوران خود و بیش از چندین سال تجربه در زمینه آموزش به خصوص آموزش کنکور در این مقاله نکاتی برای بهتر درس خواندن به وسیله توصیه های علمی و تجربی در اخیتار شما قرار می دهد . با ما تا آخر این مقاله همراه باشید.",
        title : "راهکار هایی برای بهتر درس خواندن",
        intro_text :  "برای تمامی دانش آموزان به خصوص دانش آموزان کنکوری همواره این سوال وجود دارد که چه راهی برای بهتر درس خواندن وجود دارد ؟راه های بهتر درس خواندن چیست ؟نگران نباشید تیم کاد با کمک مشاوران خود و بیش از چندین سال تجربه در زمینه آموزش به خصوص آموزش کنکور در این مقاله نکاتی برای بهتر درس خواندن به وسیله توصیه های علمی و تجربی در اخیتار شما قرار می دهد . با ما تا آخر این مقاله همراه باشید.",
        similar_post : [],
        category : "",
        main_img : sample_img,
        post_cat : post_cats.cat_1,
        final_word : {
            title : "سخن آخر ",
            text : `به طور کلی روش یا روش هایی برای انتخاب بهترین شکل درس خواندن وجود ندارد و تمامی این موارد تجربی و برخی مورد استفاده برای گروه خاصی از افراد است . برخی از افراد به صورت فردی ٫ برخی از افراد به صورت گروهی ٫ بعضی از افراد درس خواندن در شب با تمرکز بیشتر یا بالعکس را انتخاب میکنند پس سعی کنید با مشاوره درست و شناخت فردی بیشتر بهترین روش را برای خود انتخاب کنید.
مشاوران کاد با چندین سال تجربه افتخار مشاوره به دانش آموزان و رتبه های برتر را داشته اند و همواره باعث افتخار کاد هست که شما را به عنوان عضوی از خانواده خود داشته باشد
اگر نیاز به مشاوره دارید با ما تماس بگیرید 
`,
cta : "(لینک تماس یا مشاوره )"
        },
        sections : [
            {
                id : 1 , 
                title : "زمان خواب آلودگی درس بخوانید !",
                text : `در زمان خواب آلودگی درس بخوانید شاید حرفی باشد که در نگاه اول حرفی اشتباه و نادرست به نظر بیاید اما واقعیت این طور نیست.
طبق آخرین کشفی که محققان انجام داده اند : 
در زمان خواب آلودگی اگر کتابی غیر علمی در دست بگیرید و سعی کنید چند دقیقه به مطالعه بپردازید مغز شما در حین خواب حافظه شما را تقویت میکند و به همین دلیل تمام مسائلی که قبل از خواب به آنها فکر می‌کنید را بهتر به یاد آورید.
در نظر داشته باشید منظور تیم کاد این نیست که تمامی زمان مطالعه خود را به وقت خوابالودگی خود بسپارید بلکه بهتر است که در این زمان مواردی که نیاز به مرور دارند و یا شاید فرار هستند را مرور کنید به این شکل شما میتوانید حتی از خواب آلودگی خود هم برای بهتر شدن استفاده کنید.
عالی نیست ؟
`,
                img : false,
                cta : false,
            },
            {
                id : 2, 
                title : "مرور مطالب در بازه های کوتاه",
                text : `همه ی ما با شرایطی رو به رو شدیم که یه متن بلند یا یک مبحث طولانی درس رو متوجه نشدیم اما تا حالا به این فکر کردین که دلیل این اتفاق چی می تونه باشه ؟
ذهن ما مطالب کوتاه رو راحت تر یاد میگیره و اگه ما یه مطلب طولانی و بلند رو به بخش های کوچیک تقسیم کنیم و طی یک مدت طولانی همواره دوره کنیم این مطالب رو به راحتی این مطالب توی ذهن ما میمونه و بدون هیچ مشکلی میتونیم یادشون بگیریم. در واقع با انجام این کار داریم یک روش یادگیری جدید به نام (( تکرار با فاصله )) رو امتحان میکنیم. 
پس یادمون باشه برای یادگیری و ارتقا کیفیت درس خوندن‌مون میتونیم مطالب رو به قسمت های کوچیک تر تقسیم کنیم و این موارد با مرور در طولانی مدت به راحتی به خاطر بسپاریم.
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 3 , 
                title : "در هنگام درس داستان بسازید ",
                text : `این مورد به شدت در بهتر درس خواندن تاثیر داره اما شاید برای شما هم سوال باشه که چرا و چطور این اتفاق ممکنه بیوفته .
جواب سوال شما خیلی ساده است. مغز شما نیاز به یادگیری بصری و تصویری داره و همواره تو یادگیری های بصری و عملی درصد جذب و ماندگاری بالاتری برای اطلاعات در ذهن شما میزاره. همه شما شاید با این مورد برخورد کرده باشید که یک آزمایش شیمی رو وقتی توی آزمایشگاه انجام بدید براتون خیلی قابل درک تر و ماندگار تره تا اینکه همون آزمایش و واکنش شیمیایی رو صرفا از روی کتاب خونده باشید. 
پس بیاید با هم سعی کنیم هنگام درس خوندمون برای بهتر یادگیری درس این نکته رو یادمون باشه که اگر داستان سرایی بکنیم و بتونیم اون داستان رو بازگو بکنیم در ذهنمون میتونیم تمامی مطالب رو به یاد بیاریم.
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 4, 
                title : "حرکت کنید ",
                text : `شاید همیشه تو ذهن همه ما باشه که درس خوندن همیشه باید پشت میز باشه و بدون هیچ تکونی ساعت ها درس بخونیم اما برای بهتر درس خوندن خیلی از محققان معتقدند که با عوض شدن فضای درس خوندن ذهن ما مجبور میشه که با یک فضای جدید اطلاعات را دوباره به یاد خودش بیاره پس شاید بد نباشه هر از چندگاهی فضای درس خوندن یا مدل درس خوندن خودمونو عوض کنیم.`,
                img : sample_img,
                cta : false,
            },
            {
                id : 5 , 
                title : "اگه خسته شدی مبحثت رو عوض کن ",
                text : `بچه ها سال کنکور سال پرفشاریه و فقط درس خوندن و اذیت کردن خود آدم باعث موفقیت نمیشه . برای بهتر درس خوندن بهتره که ما هوشمندانه درس بخونیم . وقتی از مبحث درسی خسته میشد و حس میکنید دیگه توان ادامه‌ی اون مبحث رو ندارید به جای ترک اون درس مبحث درستون رو عوض کنید با این کار هم میل و اشتیاقتون به درس خوندن رو از دست نمیدید هم اینکه طبق تحقیق دانشمندان با خوندن مطالب متفاوت زیاد در یک روز میتوانید استراتژی های مناسب‌تری برای حل مساله و پاسخ دادن به سوالات در پیش بگیرید.`,
                img : sample_img,
                cta : false,
            },
            {
                id : 6 , 
                title : "از خودت سوال بپرس ",
                text : `سوالی که خیلی از دانش آموزا از ما دارن درباره روش دوره کردن است. آقای کاد ما چطوری دوره کنیم درس‌هامونو ؟ اصلا دوره کردن یعنی چی ؟ 
خب بیاید یک بار برای همیشه این سوال رو جواب بدیم و یکی از کارهایی که برای دوره کردن میشه انجام داد همینجا آماده اس.
وقتی با سوال های ساده و در آرامش کامل به سوال های خودتون جواب بدید مطالب خوانده شده رو به راحتی میتونید دوره کنید و بهتر درس بخونید. این نکته یکی از مهم‌ترین نکات بهتر درس خوندن برای دانش آموزهای عزیز ماست
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 7 , 
                title : "نوشتن روی کاغذ ",
                text : `شاید این مورد ساده برای بهتر درس خواندن به نظر خیلی ها نیاد ولی شما که دنبال کننده مقاله های کاد هستید هرکسی نیستید پس خوب توجه کنید.
پژوهشگران بر این باورند که هنگامی که شما مطلبی را مینویسد مغز شما این مطلب را در مکن امن تری ذخیره میکند و به یاد آوردنش بسیار ساده تر میشه.
خب وقتی یه همچین امکانی رو ذهن ما داره چرا نیاد ازش استفاده کرد ؟ 
یادتون باشه در موقع درس خوندن برای بهتر درس خواندن میتونید هرچیزی رو که یاد میگیرید رو یه تیکه کاغذ بنویسد تا بهتر توی ذهنتون بمونه.
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 8 , 
                title : "بلند بلند درس بخونید",
                text : `این مورد از اون دسته مواردی هست که به شدت میتونه به شما تو درس خوندن کمک کنه دلیلشم اینه شما یکبار درس رو میخونید و یاد میگرید و یکبار هم از طریق شنیدن اون مطلب دوباره یادگیری براتون اتفاق میوفته. `,
                img : sample_img,
                cta : false,
            },
            {
                id : 9 , 
                title : "قرار دادن جایزه ",
                text : `همه ما موقع درس خوندن خسته میشم و شاید بعضی مواقع بی انگیزه پس بهتر نیست به یه روش ساده جلوی این اتفاق رو بگیریم ؟ 
وقتی خستگی یا بی اشتیاقی برای شما پیش اومد فقط کافیه که یک جایزه برای خودتون در نظر بگیرید این جایزه میتونه گشتن کوتاه ( در حد یک ربع الی ۲۰ دقیقه ) داخل شبکه های اجتماعی باشه ٫ میتونه خوردنی برای تقویت انرژی شما موقع درس خوندن باشه . ذوق و اشتیاق رسیدن به این جایزه میتونه براتون انگیزه ای برای اتمام اون مبحث یا درس باشه. 
هرچی درس سخت تر جایزه بزرگتر.
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 10 , 
                title : "درس خوندن گروهی ",
                text : `برای بعضی افراد خیلی راحت‌تر و موثر‌تر هست که به صورت گروهی درس بخونن. به وسیله درس خوندن گروهی می‌تونید در زمان استراحت وقت ٫ استراحت بهتری داشته باشید یا حتی میتونید به کمک همدیگه مسائل رو بهتر درک کنید و به همدگیه کمک کنید.`,
                img : sample_img,
                cta : false,
            },
            {
                id : 11 , 
                title : "برنامه ریزی",
                text : `برنامه ریزی یکی از موارد مهم و تاثیر گذار توی بهتر درس خواندن است  اما موردی که نیاز است در نظر داشته باشید این است که برای برنامه ریزی صرفا منظور برنامه ریزی هفتگی نیست بلکه نیاز است برای روز و ساعت برنامه ریزی شود زیرا با انجام این کار به دستاورد و نتیجه های بی نظیری خواهید رسید و انجام شدن هرکدام از این برنامه ریزی ها علاوه بر دسته بندی مرتب در درس خواندن شما کمک روانی و ذهنی برای رسیدن به اهداف خود را دارید.
پس بهتر نیست برنامه ریزی رو از همین الان شروع کنی ؟ 
با ما در تماس باشید !  
`,
                img : sample_img,
                cta : "( لینک برای مشاوره )",
            },
            {
                id : 12 , 
                title : "ذهن آرام ",
                text : `برای رسیدن به نتیجه مطلوب بهتر است که ذهنی آرام داشته باشید چون یک ذهن مشوش به هیچ عنوان نتیجه مطلوبی را با خود به همراه نخواهد داشت.
برای رسیدن به یک ذهن آرام و آماده می توانید قبل از شروع هر امتحانی به مدت سه دقیقه به دیوار یا یک سطح غیر متحرک نگاه کنید و محققان بر این باورند که میتواند استرس را کاهش داده و توجه تمرکز شما افزایش داده شود. شما با آرام بودن ساده هم میتوانید تاثیرات مطلوبی را بر فعالیت خود حس کنید.
`,
                img : sample_img,
                cta : false,
            },
            {
                id : 13 , 
                title : "زنگ تفریح داشتن",
                text : `شما می ‌توانید با قرار دادن زنگ های تفریح کوتاه به بهتر درس خواندن خود کمک کنید. دانشمندان بر این باورند که شما با داشتن رنگ تفریح های کوتاه و فاصله گرفتن از فضای مطالعه می‌توانید افزایش بهره وری و تمرکز را داشته باشید.`,
                img : sample_img,
                cta : false,
            },
            {
                id : 14 , 
                title : "شب بیداری ممنوع ",
                text : `دانشمندان معتقدند که شب بیداری و درس خواندن شبانه میتواند تاثیرات منفی ای بر ذهن یک شخص بگذارد و باعث تولید استرس بیشتر شود پس سعی کنید در زمان امتحانات خواب ۷ تا ۹ ساعتی را داشته باشید تا خدایی ناکرده زحمات دانش آموزان عزیز بر باد نرود. `,
                img : sample_img,
                cta : false,
            },
            {
                id : 15 , 
                title : "اینترنت یعنی حواس پرتی ",
                text : `برای دانش آموزان امروزی با توجه به گسترش بستر اینترنت برای فعالیت های کمک آموزشی بهتر است در زمان درس خواندن از اینترنت برای شبکه های مجازی استفاده نکنید .  برای بهتر درس خواندن بهتر است که در زمان درس خواندن دسترسی به اینترنت به خصوص دسترسی برای فضای مجازی را محدود کنید .
می توانید از نرم افزار های پیشنهادی و مقاله کامل ما برای اینترنت و حواس پرتی در موقع درس خواندن استفاده کنید.
`,
                img : sample_img,
                cta : "( لینک مقاله ) ",
            },
            
        ],
        
    }
];
export default posts;