const fields = {
    tajrobi: [
        "ادبیات فارسی",
        "عربی",
        "دین و زندگی",
        "زبان انگلیسی",
        "زیست شناسی",
        "فیزیک",
        "شیمی",
        "ریاضیات تجربی",
    ],
    riazi: [
        "فیزیک",
        "شیمی",
        "ادبیات فارسی",
        "عربی",
        "دین و زندگی",
        "زبان انگلیسی",
        "هندسه",
        "گسسته",
        "حسابان",
    ],
    ensani: [
        "ادبیات فارسی",
        "عربی",
        "دین و زندگی",
        "زبان انگلیسی",
        "علوم و فنون ادبی",
        "فلسه و منطق",
        "عربی اختصاصی",
        "روانشناسی",
        "اقتصاد",
        "ریاضی انسانی",
    ]
}

export default fields;






