import React, { Component } from "react";
class RulesPopUp extends Component {
  state = {};
  render() {
    return (
      <div className="rules-pop-up-wrapper">
        <h2 className="rules-title">قوانین کاد</h2>
        <p className="rule">
          ثبت نام و عضویت در سایت کاد به معنی پذیرش تمامی قوانین و شرایط کاد است
        </p>
        <p className="rule">
          تعاریف : واژه های کلیدی استفاده شده در شرایط و قوانین استفاده از
           سامانه کاد به معنای زیر است: کاربر- دانش آموز: هر فردی که در سایت کاد
          ثبت نام کرده را گویند. سایت کاد: به سایت kadschool.com و تمامی زیر
          دامنه های آن گویند. دوره : به هر آنچه محتوای ویدیویی و تصویری و متنی و
          صوتی که برای کاربر- دانش آموز در مدت زمان معینی ارايه میشود را گویند.
        </p>
        <p className="rule">
          مدت زمان اعتبار استفاده از محتوای کاد: مدت زمان استفاده از تمامی
          محتوای آنلاین و آفلاین بارگذاری شده در سایت کاد تا برگزاری کنکور همان
          دوره می باشد و برای دانش آموزان پایه های دیگر تا پایان سال تحصیلی قابل
          استفاده خواهد بود.
        </p>
        <p className="rule">
          مدت زمان اعتبار استفاده از محتوای کاد: مدت زمان استفاده از تمامی
          محتوای آنلاین و آفلاین بارگذاری شده در سایت کاد تا برگزاری کنکور همان
          دوره می باشد و برای دانش آموزان پایه های دیگر تا پایان سال تحصیلی قابل
          استفاده خواهد بود.
        </p>
        <p className="rule">
          ریم خصوصی کاد خود را موظف میداند در حد توان امنیت حریم شخصی کاربران
          خود را تامین نماید و هیچگونه از مشخصات کاربران خود را به هیچ گونه
          موسسه ی غیر همکاری در خارج از موسسه ارایه ندهد کاد میتواند برای
          پشتیبانی و ارایه بهتر خدمات اطلاعات تماس کاربران خود را به پشتیبانان
          تحت نظر موسسه کاد ارایه دهد
        </p>
        <p className="rule">
          مسئولیت حفظ اطلاعات کاربران از جمله شناسه کاربر و رمز عبور برای ورود
          به سایت کاد برعهده کاربر بوده و در صورت مشاهده هر گونه فعالیت مشکوک یا
          احتمال استفاده کاربر دیگری جز دانش آموز ثبت نامی ، کاد می تواند هرگونه
          دسترسی کاربر را به کلاس ها سلب کند و کاد مییتواند در صورت پیگیری های
          قضایی را تا حصول نتیجه انجام دهد.
        </p>
        <p className="rule">
          به روز رسانی سایت کاد می تواند هر زمان که بخواهد در سایت کاد هرگونه
          تغییراتی را اعمال کند که ای تغییرات ممکن است برای بازه زمانی باعث
          اختلال یا قطعی عملکرد سایت شود و دانش آموز با علم به این که ممکن است
          این اختلالات رخ دهد حق هر گونه درخواست خسارات را نسبت به موسسه ندارد.
        </p>
        <p className="rule">
          ضوابط عمومی کاد هیچگونه مسئولیتی نسبت به پرداخت های مبالغی که به حساب
          هایی غیر از حساب موسسه کاد واریز میشود ندارد
        </p>
        <p className="rule">
          کاربر تحت هیچ شرایطی حق بازپخش محتوای دریافت شده در هیچ محیطی تحت هیچ
          عنوانی را نخواهد داشت و تمام حقوق مادی و معنوی استفاده از تمامی
          امکانات موسسه و سایت کاد متعلق با کاد است و بدیهی است که در صورت تخلف
          کاربر، حق هر گونه تعقیب کیفری و مطالبه خسارت حقوقی را برای کاد محفوظ
          می باشد
        </p>
        <p className="rule">
          هر کاربر در سایت کاد تنها میتواند یک اکانت کاربری داشته باشد و در
          صورتی که کاربر از چند اکانت کاربری استفاده نماید کاد میتواند اکانت های
          کاربری اضافه را حتی در صورت این که در آن اکانت ها کلاسی ثبت نام کرده
          باشد را لغو نماید
        </p>
        <p className="rule">
          کاد این حق را دارد که برای تبلیغات خود از مشخصات رتبه های برتر خود هر
          گونه استفاده ای را بکند.
        </p>
        <p className="rule">
          تغییر شرایط و قوانین کاد می تواند در هر زمان هر گونه تغییری را در
          قوانین انجام دهد و تغییرات ایجاده شده را در همین صفحه منتشر می کند و
          ثبت نام کاربر به منزله پذیرش هر گونه به روز رسانی قوانین می باشد
        </p>
      </div>
    );
  }
}

export default RulesPopUp;
